In [1]:
# Python and Data
'''
csv : 2d
json : 2d+
parquet : column oriented formats
'''

'\ncsv : 2d\njson : 2d+\nparquet : column oriented formats\n'

In [2]:
import csv

In [3]:
# Open file
f = open('./titanic.csv')
# read csv file and store it as opaque object in reader variable
reader = csv.reader(f)
# list(reader)

In [4]:
# next() is used to increase the pointer by one and return the row at which the pointer was previously
header = next(reader)
print(header)

['Survived', 'Pclass', 'Sex', 'Age', 'Siblings/Spouses', 'Parents/Children', 'Fare']

In [5]:
# Count total number of people survived.
count = 0
for row in reader:
    if row[0] == "1":
        count+=1
print(f"Total {count} no. of people survived.")

Total 342 no. of people survived.

In [6]:
# JSON

In [7]:
import json

In [8]:
f = open("./titanic.json")
titanic = json.load(f)

In [9]:
type(titanic)

list

In [10]:
# Pandas

In [11]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn
import sklearn

In [12]:
df = pd.read_csv('titanic.csv')

In [13]:
df.size

6209

In [14]:
df.shape

(887, 7)

In [15]:
df.head()

   Survived  Pclass     Sex   Age  Siblings/Spouses  Parents/Children     Fare
0         0       3    male  22.0                 1                 0   7.2500
1         1       1  female  38.0                 1                 0  71.2833
2         1       3  female  26.0                 0                 0   7.9250
3         1       1  female  35.0                 1                 0  53.1000
4         0       3    male  35.0                 0                 0   8.0500

In [16]:
## DAY 2

In [17]:
df = pd.read_csv("./Olympic_medals.csv")

In [18]:
df

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal
0,Montreal,1976.0,Aquatics,Diving,3m springboard,"Kï¿½HLER, Christa",Women,GDR,East Germany,W,Silver
1,Montreal,1976.0,Aquatics,Diving,3m springboard,"KOSENKOV, Aleksandr",Men,URS,Soviet Union,M,Bronze
2,Montreal,1976.0,Aquatics,Diving,3m springboard,"BOGGS, Philip George",Men,USA,United States,M,Gold
3,Montreal,1976.0,Aquatics,Diving,3m springboard,"CAGNOTTO, Giorgio Franco",Men,ITA,Italy,M,Silver
4,Montreal,1976.0,Aquatics,Diving,10m platform,"WILSON, Deborah Keplar",Women,USA,United States,W,Bronze
...,...,...,...,...,...,...,...,...,...,...,...
15428,Beijing,2008.0,Wrestling,Wrestling Gre-R,66 - 74kg,"GUENOT, Christophe",Men,FRA,France,M,Bronze
15429,Beijing,2008.0,Wrestling,Wrestling Gre-R,66 - 74kg,"KVIRKELIA, Manuchar",Men,GEO,Georgia,M,Gold
15430,Beijing,2008.0,Wrestling,Wrestling Gre-R,55 - 60kg,"RAHIMOV, Vitaliy",Men,AZE,Azerbaijan,M,Silver
15431,Beijing,2008.0,Wrestling,Wrestling Gre-R,60 - 66kg,"GUENOT, Steeve",Men,FRA,France,M,Gold
15432,Beijing,2008.0,Wrestling,Wrestling Gre-R,96 - 120kg,"LOPEZ, Mijain",Men,CUB,Cuba,M,Gold

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
len(df), len(df['City'])

(15433, 15433)

In [21]:
type(df["Year"]), type(df["Year"][0])

(pandas.core.series.Series, numpy.float64)

In [22]:
df["Year"]

0        1976.0
1        1976.0
2        1976.0
3        1976.0
4        1976.0
          ...
15428    2008.0
15429    2008.0
15430    2008.0
15431    2008.0
15432    2008.0
Name: Year, Length: 15433, dtype: float64

In [23]:
# Above command can also be accomplished in this way. but it has its lilitations:
# it cant support names with spaces and names that are reserved keywords
df.Year

0        1976.0
1        1976.0
2        1976.0
3        1976.0
4        1976.0
          ...
15428    2008.0
15429    2008.0
15430    2008.0
15431    2008.0
15432    2008.0
Name: Year, Length: 15433, dtype: float64

In [24]:
df.columns

Index(['City', 'Year', 'Sport', 'Discipline', 'Event', 'Athlete', 'Gender',
       'Country_Code', 'Country', 'Event_gender', 'Medal'],
      dtype='object')

In [25]:
type(df.columns)

pandas.core.indexes.base.Index

In [26]:
df.index

RangeIndex(start=0, stop=15433, step=1)

In [27]:
df[['City', 'Year']]

           City    Year
0      Montreal  1976.0
1      Montreal  1976.0
2      Montreal  1976.0
3      Montreal  1976.0
4      Montreal  1976.0
...         ...     ...
15428   Beijing  2008.0
15429   Beijing  2008.0
15430   Beijing  2008.0
15431   Beijing  2008.0
15432   Beijing  2008.0

[15433 rows x 2 columns]

In [28]:
num1 = [1,2,3,4,5]
num2 = [6,7,8,9,0]
# Works at macro-level
num1+num2, [n1+n2 for n1,n2 in zip(num1,num2)]

([1, 2, 3, 4, 5, 6, 7, 8, 9, 0], [7, 9, 11, 13, 5])

In [29]:
dummy = pd.DataFrame({'a':[1,2,3,4,5], 'b':[6,7,8,9,0]})

In [30]:
dummy

   a  b
0  1  6
1  2  7
2  3  8
3  4  9
4  5  0

In [31]:
# Works at icrolevel
# Vectorised Operations
dummy['sum'] = dummy['a']+dummy['b']

In [32]:
dummy

   a  b  sum
0  1  6    7
1  2  7    9
2  3  8   11
3  4  9   13
4  5  0    5

In [33]:
dummy['a']>dummy['b']

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [34]:
dummy[dummy['a']>dummy['b']]

   a  b  sum
4  5  0    5

In [35]:
df.head()

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal
0,Montreal,1976.0,Aquatics,Diving,3m springboard,"Kï¿½HLER, Christa",Women,GDR,East Germany,W,Silver
1,Montreal,1976.0,Aquatics,Diving,3m springboard,"KOSENKOV, Aleksandr",Men,URS,Soviet Union,M,Bronze
2,Montreal,1976.0,Aquatics,Diving,3m springboard,"BOGGS, Philip George",Men,USA,United States,M,Gold
3,Montreal,1976.0,Aquatics,Diving,3m springboard,"CAGNOTTO, Giorgio Franco",Men,ITA,Italy,M,Silver
4,Montreal,1976.0,Aquatics,Diving,10m platform,"WILSON, Deborah Keplar",Women,USA,United States,W,Bronze

In [36]:
# Medals for India
df[df['Country_Code'] == 'IND']

,City,Year,Sport,Discipline,Event,Athlete,Gender,Country_Code,Country,Event_gender,Medal
2288,Moscow,1980.0,Hockey,Hockey,hockey,"SINGH, Singh",Men,IND,India,M,Gold
2289,Moscow,1980.0,Hockey,Hockey,hockey,"FERNANDES, Mervyn",Men,IND,India,M,Gold
2294,Moscow,1980.0,Hockey,Hockey,hockey,"GURMAIL, Singh",Men,IND,India,M,Gold
2302,Moscow,1980.0,Hockey,Hockey,hockey,"BASKARAN, Baskaran",Men,IND,India,M,Gold
2303,Moscow,1980.0,Hockey,Hockey,hockey,"ZAFAR, Zafar",Men,IND,India,M,Gold
2313,Moscow,1980.0,Hockey,Hockey,hockey,"MOHAMMAD, Shahid",Men,IND,India,M,Gold
2320,Moscow,1980.0,Hockey,Hockey,hockey,"SINGH, Singh",Men,IND,India,M,Gold
2339,Moscow,1980.0,Hockey,Hockey,hockey,"KAUSHIK, Maharaj Krishon",Men,IND,India,M,Gold
2341,Moscow,1980.0,Hockey,Hockey,hockey,"SURINDER, Singh",Men,IND,India,M,Gold
2347,Moscow,1980.0,Hockey,Hockey,hockey,"KUMAR, Charanjit",Men,IND,India,M,Gold
2348,Moscow,1980.0,Hockey,Hockey,hockey,"SYLVANUS, Dung Dung",Men,IND,India,M,Gold
2350,Moscow,1980.0,Hockey,Hockey,hockey,"DEAVINDER, Singh",Men,IND,India,M,Gold
2370,Moscow,1980.0,Hockey,Hockey,hockey,"AMARJIT RANA, Singh",Men,IND,India,M,Gold
2375,Moscow,1980.0,Hockey,Hockey,hockey,"ALLAN, Schofield",Men,IND,India,M,Gold
2377,Moscow,1980.0,Hockey,Hockey,hockey,"CHETTRI, Chettri",Men,IND,India,M,Gold
2378,Moscow,1980.0,Hockey,Hockey,hockey,"MANEYPANDA, Somaya",Men,IND,India,M,Gold
9191,Atlanta,1996.0,Tennis,Tennis,singles,"PAES, Leander",Men,IND,India,M,Bronze
11324,Sydney,2000.0,Weightlifting,Weightlifting,69kg,"MALLESWARI, Karnam",Women,IND,India,W,Bronze
13051,Athens,2004.0,Shooting,Shooting,double trap (150 targets),"RATHORE, Rajyavardhan S.",Men,IND,India,M,Silver
14125,Beijing,2008.0,Boxing,Boxing,69 - 75 kg,"KUMAR, Vijender",Men,IND,India,M,Bronze
15073,Beijing,2008.0,Shooting,Shooting,10m air rifle (60 shots),"BINDRA, Abhinav",Men,IND,India,M,Gold
15389,Beijing,2008.0,Wrestling,Wrestling Free.,60 - 66kg,"KUMAR, Sushil",Men,IND,India,M,Bronze

In [37]:
set(df.Sport)

{'Aquatics',
 'Archery',
 'Athletics',
 'Badminton',
 'Baseball',
 'Basketball',
 'Boxing',
 'Canoe / Kayak',
 'Cycling',
 'Equestrian',
 'Fencing',
 'Football',
 'Gymnastics',
 'Handball',
 'Hockey',
 'Judo',
 'Modern Pentathlon',
 'Rowing',
 'Sailing',
 'Shooting',
 'Softball',
 'Table Tennis',
 'Taekwondo',
 'Tennis',
 'Triathlon',
 'Volleyball',
 'Weightlifting',
 'Wrestling',
 nan}

In [38]:
# How many Football medals have been distributed throughout olympics
len(df[df['Sport'] == 'Football'])

669

In [39]:
# How many years this games data is for?
len(df.Year.unique())

10

In [40]:
df.Year.values

array([1976., 1976., 1976., ..., 2008., 2008., 2008.])

In [41]:
df.Year.unique()

array([1976.,   nan, 1980., 1984., 1988., 1992., 1996., 2000., 2004.,
       2008.])

In [42]:
# Is the world getting more egalitarian on gender over the years
y1976 = df[df['Year'] == 1976]
y2008 = df[df['Year'] == 2008]

In [43]:
len(y1976[y1976['Gender'] == 'Women'])/len(y1976[y1976['Gender'] == 'Men'])

0.41233766233766234

In [44]:
len(y2008[y2008['Gender'] == 'Women'])/len(y2008[y2008['Gender'] == 'Men'])

0.8396396396396396

In [45]:
df['Year']

0        1976.0
1        1976.0
2        1976.0
3        1976.0
4        1976.0
          ...
15428    2008.0
15429    2008.0
15430    2008.0
15431    2008.0
15432    2008.0
Name: Year, Length: 15433, dtype: float64